#!/usr/bin/env python
# -*- coding: utf-8 -*-
# module: ggb_constants.py

"""
Just some constants

"""

# GGB_SECTORS = {}
# for i in range(10, 34):  # range(a,b) gives [a,b)
    # GGB_SECTORS[i] = 'Μεταποίηση'
# for i in range(41, 44):
    # GGB_SECTORS[i] = "Κατασκευές"
# for i in range(45, 48):
    # GGB_SECTORS[i] = "Εμπόριο"
# for i in range(58, 64):
    # GGB_SECTORS[i] = "ΤΠΕ"
# for i in range(70, 75):
    # GGB_SECTORS[i] = "Επαγ/Επιστ. Δρ."
# GGB_SECTORS[86] = "Υγεία"

GGB_SECTORS = {
    10: 'Μεταποίηση',
    11: 'Μεταποίηση',
    12: 'Μεταποίηση',
    13: 'Μεταποίηση',
    14: 'Μεταποίηση',
    15: 'Μεταποίηση',
    16: 'Μεταποίηση',
    17: 'Μεταποίηση',
    18: 'Μεταποίηση',
    19: 'Μεταποίηση',
    20: 'Μεταποίηση',
    21: 'Μεταποίηση',
    22: 'Μεταποίηση',
    23: 'Μεταποίηση',
    24: 'Μεταποίηση',
    25: 'Μεταποίηση',
    26: 'Μεταποίηση',
    27: 'Μεταποίηση',
    28: 'Μεταποίηση',
    29: 'Μεταποίηση',
    30: 'Μεταποίηση',
    31: 'Μεταποίηση',
    32: 'Μεταποίηση',
    33: 'Μεταποίηση',
    41: 'Κατασκευές',
    42: 'Κατασκευές',
    43: 'Κατασκευές',
    45: 'Εμπόριο',
    46: 'Εμπόριο',
    47: 'Εμπόριο',
    58: 'ΤΠΕ',
    59: 'ΤΠΕ',
    60: 'ΤΠΕ',
    61: 'ΤΠΕ',
    62: 'ΤΠΕ',
    63: 'ΤΠΕ',
    70: 'Επαγ/Επιστ. Δρ.',
    71: 'Επαγ/Επιστ. Δρ.',
    72: 'Επαγ/Επιστ. Δρ.',
    73: 'Επαγ/Επιστ. Δρ.',
    74: 'Επαγ/Επιστ. Δρ.',
    86: 'Υγεία'
}


__all__ = [
    "GGB_SECTORS",
]
